Ran Plan for dir: `terraform` workspace: `homelab`

<details><summary>Show Output</summary>

```diff
module.cname-records.cloudflare_record.record["1"]: Drift detected (update)
module.cname-records.cloudflare_record.record["4"]: Drift detected (update)
module.cname-records.cloudflare_record.record["0"]: Drift detected (update)
module.cname-records.cloudflare_record.record["7"]: Drift detected (update)
module.cname-records.cloudflare_record.record["8"]: Drift detected (update)
module.cname-records.cloudflare_record.record["5"]: Drift detected (update)
module.cname-records.cloudflare_record.record["6"]: Drift detected (update)
module.cname-records.cloudflare_record.record["2"]: Drift detected (update)
module.cname-records.cloudflare_record.record["3"]: Drift detected (update)
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "dns" but a value was
│ found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-U7PCJcAW7TmY3CEM/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Deprecated Resource
│ 
│   with module.zero-trust-app.cloudflare_access_policy.github_app_policy,
│   on modules/zero_trust_application/main.tf line 12, in resource "cloudflare_access_policy" "github_app_policy":
│   12: resource "cloudflare_access_policy" "github_app_policy" {
│ 
│ `cloudflare_access_policy` is now deprecated and will be removed in the
│ next major version. Use `cloudflare_zero_trust_access_policy` instead.
╵
╷
│ Warning: Deprecated Resource
│ 
│   with module.zero-trust-app.cloudflare_access_policy.github_app_policy["6"],
│   on modules/zero_trust_application/main.tf line 12, in resource "cloudflare_access_policy" "github_app_policy":
│   12: resource "cloudflare_access_policy" "github_app_policy" {
│ 
│ `cloudflare_access_policy` is now deprecated and will be removed in the
│ next major version. Use `cloudflare_zero_trust_access_policy` instead.
╵
╷
│ Warning: Deprecated Resource
│ 
│   with module.zero-trust-app.cloudflare_access_policy.github_app_policy["0"],
│   on modules/zero_trust_application/main.tf line 12, in resource "cloudflare_access_policy" "github_app_policy":
│   12: resource "cloudflare_access_policy" "github_app_policy" {
│ 
│ `cloudflare_access_policy` is now deprecated and will be removed in the
│ next major version. Use `cloudflare_zero_trust_access_policy` instead.
╵
╷
│ Warning: Deprecated Resource
│ 
│   with module.zero-trust-app.cloudflare_access_policy.github_app_policy["5"],
│   on modules/zero_trust_application/main.tf line 12, in resource "cloudflare_access_policy" "github_app_policy":
│   12: resource "cloudflare_access_policy" "github_app_policy" {
│ 
│ `cloudflare_access_policy` is now deprecated and will be removed in the
│ next major version. Use `cloudflare_zero_trust_access_policy` instead.
╵
╷
│ Warning: Deprecated Resource
│ 
│   with module.zero-trust-app.cloudflare_access_policy.github_app_policy["2"],
│   on modules/zero_trust_application/main.tf line 12, in resource "cloudflare_access_policy" "github_app_policy":
│   12: resource "cloudflare_access_policy" "github_app_policy" {
│ 
│ `cloudflare_access_policy` is now deprecated and will be removed in the
│ next major version. Use `cloudflare_zero_trust_access_policy` instead.
╵
╷
│ Warning: Deprecated Resource
│ 
│   with module.zero-trust-app.cloudflare_access_policy.github_app_policy["1"],
│   on modules/zero_trust_application/main.tf line 12, in resource "cloudflare_access_policy" "github_app_policy":
│   12: resource "cloudflare_access_policy" "github_app_policy" {
│ 
│ `cloudflare_access_policy` is now deprecated and will be removed in the
│ next major version. Use `cloudflare_zero_trust_access_policy` instead.
╵
╷
│ Warning: Deprecated Resource
│ 
│   with module.zero-trust-app.cloudflare_access_policy.github_app_policy["3"],
│   on modules/zero_trust_application/main.tf line 12, in resource "cloudflare_access_policy" "github_app_policy":
│   12: resource "cloudflare_access_policy" "github_app_policy" {
│ 
│ `cloudflare_access_policy` is now deprecated and will be removed in the
│ next major version. Use `cloudflare_zero_trust_access_policy` instead.
╵
╷
│ Warning: Deprecated Resource
│ 
│   with module.zero-trust-app.cloudflare_access_policy.github_app_policy["4"],
│   on modules/zero_trust_application/main.tf line 12, in resource "cloudflare_access_policy" "github_app_policy":
│   12: resource "cloudflare_access_policy" "github_app_policy" {
│ 
│ `cloudflare_access_policy` is now deprecated and will be removed in the
│ next major version. Use `cloudflare_zero_trust_access_policy` instead.
╵
╷
│ Warning: Argument is deprecated
│ 
│   with module.cname-records.cloudflare_record.record["8"],
│   on modules/dns_records/main.tf line 5, in resource "cloudflare_record" "record":
│    5:   value   = var.dns
│ 
│ `value` is deprecated in favour of `content` and will be removed in the
│ next major release.
╵
╷
│ Warning: Argument is deprecated
│ 
│   with module.cname-records.cloudflare_record.record["0"],
│   on modules/dns_records/main.tf line 5, in resource "cloudflare_record" "record":
│    5:   value   = var.dns
│ 
│ `value` is deprecated in favour of `content` and will be removed in the
│ next major release.
╵
╷
│ Warning: Argument is deprecated
│ 
│   with module.cname-records.cloudflare_record.record["2"],
│   on modules/dns_records/main.tf line 5, in resource "cloudflare_record" "record":
│    5:   value   = var.dns
│ 
│ `value` is deprecated in favour of `content` and will be removed in the
│ next major release.
╵
╷
│ Warning: Argument is deprecated
│ 
│   with module.cname-records.cloudflare_record.record["6"],
│   on modules/dns_records/main.tf line 5, in resource "cloudflare_record" "record":
│    5:   value   = var.dns
│ 
│ `value` is deprecated in favour of `content` and will be removed in the
│ next major release.
╵
╷
│ Warning: Argument is deprecated
│ 
│   with module.cname-records.cloudflare_record.record["5"],
│   on modules/dns_records/main.tf line 5, in resource "cloudflare_record" "record":
│    5:   value   = var.dns
│ 
│ `value` is deprecated in favour of `content` and will be removed in the
│ next major release.
╵
╷
│ Warning: Argument is deprecated
│ 
│   with module.cname-records.cloudflare_record.record["4"],
│   on modules/dns_records/main.tf line 5, in resource "cloudflare_record" "record":
│    5:   value   = var.dns
│ 
│ `value` is deprecated in favour of `content` and will be removed in the
│ next major release.
╵
╷
│ Warning: Argument is deprecated
│ 
│   with module.cname-records.cloudflare_record.record["7"],
│   on modules/dns_records/main.tf line 5, in resource "cloudflare_record" "record":
│    5:   value   = var.dns
│ 
│ `value` is deprecated in favour of `content` and will be removed in the
│ next major release.
╵
╷
│ Warning: Argument is deprecated
│ 
│   with module.cname-records.cloudflare_record.record["9"],
│   on modules/dns_records/main.tf line 5, in resource "cloudflare_record" "record":
│    5:   value   = var.dns
│ 
│ `value` is deprecated in favour of `content` and will be removed in the
│ next major release.
╵
╷
│ Warning: Argument is deprecated
│ 
│   with module.cname-records.cloudflare_record.record["1"],
│   on modules/dns_records/main.tf line 5, in resource "cloudflare_record" "record":
│    5:   value   = var.dns
│ 
│ `value` is deprecated in favour of `content` and will be removed in the
│ next major release.
╵
╷
│ Warning: Argument is deprecated
│ 
│   with module.cname-records.cloudflare_record.record["3"],
│   on modules/dns_records/main.tf line 5, in resource "cloudflare_record" "record":
│    5:   value   = var.dns
│ 
│ `value` is deprecated in favour of `content` and will be removed in the
│ next major release.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.cname-records.cloudflare_record.record["9"] will be created
+ resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + content         = (known after apply)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "alloy"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "ninebasetwo.net"
      + zone_id         = (sensitive value)
    }

  # module.zero-trust-app.cloudflare_access_policy.github_app_policy["6"] will be created
+ resource "cloudflare_access_policy" "github_app_policy" {
      + application_id = (known after apply)
      + decision       = "allow"
      + id             = (known after apply)
      + name           = "6-github-auth"
      + precedence     = 1
      + zone_id        = (sensitive value)

      + include {
          + group = [
              + "dc009146-1f84-4d2c-bbd4-670ee9d65d5d",
            ]
        }
    }

  # module.zero-trust-app.cloudflare_zero_trust_access_application.app["6"] will be created
+ resource "cloudflare_zero_trust_access_application" "app" {
      + account_id                   = (known after apply)
      + app_launcher_visible         = true
      + aud                          = (known after apply)
      + auto_redirect_to_identity    = false
      + domain                       = "alloy.ninebasetwo.net"
      + domain_type                  = (known after apply)
      + enable_binding_cookie        = false
      + http_only_cookie_attribute   = true
      + id                           = (known after apply)
      + name                         = "alloy"
      + options_preflight_bypass     = false
      + service_auth_401_redirect    = false
      + session_duration             = "24h"
      + skip_app_launcher_login_page = false
      + skip_interstitial            = false
      + type                         = "self_hosted"
      + zone_id                      = (sensitive value)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terraform -w homelab
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis-0:4141/lock?id=ThomasCardin%252Fhomelab%252Fterraform%252Fhomelab)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terraform -w homelab
  ```
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```